TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0l111x.h
/******************************************************************************
* Processor and Core Peripheral Section                                       *
******************************************************************************/

#define __CM0PLUS_REV           0x0001U    /* Core revision r0p1 */
#define __MPU_PRESENT           0x0001U    /* MPU present */
#define __VTOR_PRESENT          0x0001U    /* VTOR present */
#define __NVIC_PRIO_BITS        0x0002U    /* Number of bits used for Priority Levels */
#define __Vendor_SysTickConfig  0x0000U    /* Set to 1 if different SysTick Config is used */

#include "core_cm0plus.h"                  /* Processor and core peripherals */

/******************************************************************************
* Peripheral headers                                                          *
******************************************************************************/
/** @addtogroup MSPM0L111X_Peripherals MSPM0L111X Peripherals
  MSPM0L111X Peripheral registers structures
  @{
*/

#include <ti/devices/msp/peripherals/hw_adc12.h>
#include <ti/devices/msp/peripherals/hw_aesadv.h>
#include <ti/devices/msp/peripherals/hw_crcp.h>
#include <ti/devices/msp/peripherals/hw_dma.h>
#include <ti/devices/msp/peripherals/hw_flashctl.h>
#include <ti/devices/msp/peripherals/hw_gpio.h>
#include <ti/devices/msp/peripherals/hw_gptimer.h>
#include <ti/devices/msp/peripherals/hw_i2c.h>
#include <ti/devices/msp/peripherals/hw_iomux.h>
#include <ti/devices/msp/peripherals/hw_keystorectl.h>
#include <ti/devices/msp/peripherals/hw_lfss.h>
#include <ti/devices/msp/peripherals/hw_rtc.h>
#include <ti/devices/msp/peripherals/hw_spi.h>
#include <ti/devices/msp/peripherals/hw_trng.h>
#include <ti/devices/msp/peripherals/hw_uart.h>
#include <ti/devices/msp/peripherals/hw_vref.h>
#include <ti/devices/msp/peripherals/hw_wuc.h>
#include <ti/devices/msp/peripherals/hw_wwdt.h>
#include <ti/devices/msp/peripherals/m0p/hw_factoryregion.h>
#include <ti/devices/msp/peripherals/m0p/hw_cpuss.h>
#include <ti/devices/msp/peripherals/m0p/hw_debugss.h>
#include <ti/devices/msp/peripherals/m0p/hw_sysctl.h>

#define __MSPM0_HAS_ADC12__
#define __MSPM0_HAS_GPIO__
#define __MSPM0_HAS_TIMER_A__
#define __MSPM0_HAS_TIMER_G__
#define __MSPM0_HAS_I2C__
#define __MSPM0_HAS_SPI__
#define __MSPM0_HAS_TRNG__
#define __MSPM0_HAS_RTC_B__
#define __MSPM0_HAS_UART_EXTD__
#define __MSPM0_HAS_UART_MAIN__
#define __MSPM0_HAS_VREF__
#define __MSPM0_HAS_WWDT__
#define __MSPM0_HAS_AESADV__
#define __MSPM0_HAS_CRCP__
#define __MSPM0_HAS_KEYSTORE_CTL__
#define __MSPM0_HAS_IWDT__
#define __MSPM0_HAS_LFSS__
#define __MSPM0_HAS_ECC__
#define __MSPM0_HAS_LEGACY_ADC_REFERENCE__ 

#define __GPIO_ERR_06__

/*@}*/ /* end of group MSPM0L111X_Peripherals */

/******************************************************************************
* Device and peripheral memory map                                            *
******************************************************************************/
/** @addtogroup MSPM0L111X_MemoryMap MSPM0L111X Memory Mapping
  @{
*/

#define DEBUGSS_BASE                   (0x400C7000U)     /*!< Base address of module DEBUGSS */
#define TIMA0_BASE                     (0x40860000U)     /*!< Base address of module TIMA0 */
#define AESADV_BASE                    (0x40442000U)     /*!< Base address of module AESADV */
#define TIMG8_BASE                     (0x40090000U)     /*!< Base address of module TIMG8 */
#define I2C0_BASE                      (0x400F0000U)     /*!< Base address of module I2C0 */
#define SPI0_BASE                      (0x40468000U)     /*!< Base address of module SPI0 */
#define TIMG0_BASE                     (0x40084000U)     /*!< Base address of module TIMG0 */
#define UART1_BASE                     (0x40100000U)     /*!< Base address of module UART1 */
#define WWDT0_BASE                     (0x40080000U)     /*!< Base address of module WWDT0 */
#define UART0_BASE                     (0x40108000U)     /*!< Base address of module UART0 */
#define TRNG_BASE                      (0x40444000U)     /*!< Base address of module TRNG */
#define KEYSTORECTL_BASE               (0x400AC000U)     /*!< Base address of module KEYSTORECTL */
#define GPIOA_BASE                     (0x400A0000U)     /*!< Base address of module GPIOA */
#define CRCP0_BASE                     (0x40440000U)     /*!< Base address of module CRCP0 */
#define VREF_BASE                      (0x40030000U)     /*!< Base address of module VREF */
#define GPIOB_BASE                     (0x400A2000U)     /*!< Base address of module GPIOB */
#define ADC0_BASE                      (0x40004000U)     /*!< Base address of module ADC0 */
#define ADC0_PERIPHERALREGIONSVT_BASE  (0x4055A000U)     /*!< Base address of module ADC0_PERIPHERALREGIONSVT */
#define TIMG1_BASE                     (0x40086000U)     /*!< Base address of module TIMG1 */
#define LFSS_BASE                      (0x40094000U)     /*!< Base address of module LFSS */
#define RTC_B_BASE                     (0x40094000U)     /*!< Base address of module RTC_B */
#define IOMUX_BASE                     (0x40428000U)     /*!< Base address of module IOMUX */
#define DMA_BASE                       (0x4042A000U)     /*!< Base address of module DMA */
#define WUC_BASE                       (0x40424000U)     /*!< Base address of module WUC */
#define CPUSS_BASE                     (0x40400000U)     /*!< Base address of module CPUSS */
#define FLASHCTL_BASE                  (0x400CD000U)     /*!< Base address of module FLASHCTL */
#define SYSCTL_BASE                    (0x400AF000U)     /*!< Base address of module SYSCTL */
#define FACTORYREGION_BASE             (0x41C40000U)     /*!< Base address of module FACTORYREGION */

/*@}*/ /* end of group MSPM0L111X_MemoryMap */

/******************************************************************************
* Peripheral declarations                                                     *
******************************************************************************/
/** @addtogroup MSPM0L111X_PeripheralDecl MSPM0L111X Peripheral Declaration
  @{
*/

