TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0l111x.h
/* IOMUX_PINCM45[PF] Bits */
#define IOMUX_PINCM45_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM45_PF_GPIOB_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM45_PF_SPI0_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM45_PF_TIMG8_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM45_PF_UART0_CTS                    ((uint32_t)0X00000005)
#define IOMUX_PINCM45_PF_TIMG8_IDX                    ((uint32_t)0X00000007)

/* IOMUX_PINCM46[PF] Bits */
#define IOMUX_PINCM46_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM46_PF_GPIOA_DIO21                  ((uint32_t)0X00000001)
#define IOMUX_PINCM46_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000003)
#define IOMUX_PINCM46_PF_UART1_CTS                    ((uint32_t)0X00000004)
#define IOMUX_PINCM46_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM46_PF_TIMG8_CCP0                   ((uint32_t)0X00000009)

/* IOMUX_PINCM47[PF] Bits */
#define IOMUX_PINCM47_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM47_PF_GPIOA_DIO22                  ((uint32_t)0X00000001)
#define IOMUX_PINCM47_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000003)
#define IOMUX_PINCM47_PF_UART1_RTS                    ((uint32_t)0X00000004)
#define IOMUX_PINCM47_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM47_PF_TIMA0_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM47_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000007)
#define IOMUX_PINCM47_PF_I2C0_SCL                     ((uint32_t)0X00000008)
#define IOMUX_PINCM47_PF_TIMG8_CCP1                   ((uint32_t)0X00000009)

/* IOMUX_PINCM48[PF] Bits */
#define IOMUX_PINCM48_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM48_PF_GPIOB_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM48_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000002)
#define IOMUX_PINCM48_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM48_PF_TIMA_FAULT1                  ((uint32_t)0X00000006)
#define IOMUX_PINCM48_PF_TIMA0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM48_PF_I2C0_SDA                     ((uint32_t)0X00000009)

/* IOMUX_PINCM52[PF] Bits */
#define IOMUX_PINCM52_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM52_PF_GPIOB_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM52_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000002)
#define IOMUX_PINCM52_PF_SPI0_CS1_POCI1               ((uint32_t)0X00000003)
#define IOMUX_PINCM52_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM52_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000006)
#define IOMUX_PINCM52_PF_UART0_TX                     ((uint32_t)0X0000000A)
#define IOMUX_PINCM52_PF_UART0_RX                     ((uint32_t)0X0000000B)

/* IOMUX_PINCM53[PF] Bits */
#define IOMUX_PINCM53_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM53_PF_GPIOA_DIO23                  ((uint32_t)0X00000001)
#define IOMUX_PINCM53_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000003)
#define IOMUX_PINCM53_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM53_PF_TIMG8_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM53_PF_TIMG0_CCP0                   ((uint32_t)0X00000008)

/* IOMUX_PINCM54[PF] Bits */
#define IOMUX_PINCM54_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM54_PF_GPIOA_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM54_PF_DEBUGSS_SWDIO_ALT            ((uint32_t)0X00000002)
#define IOMUX_PINCM54_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000003)
#define IOMUX_PINCM54_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM54_PF_TIMG8_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM54_PF_TIMG0_CCP1                   ((uint32_t)0X00000009)

/* IOMUX_PINCM55[PF] Bits */
#define IOMUX_PINCM55_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM55_PF_GPIOA_DIO25                  ((uint32_t)0X00000001)
#define IOMUX_PINCM55_PF_DEBUGSS_SWCLK_ALT            ((uint32_t)0X00000002)
#define IOMUX_PINCM55_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM55_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000006)

/* IOMUX_PINCM59[PF] Bits */
#define IOMUX_PINCM59_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM59_PF_GPIOA_DIO26                  ((uint32_t)0X00000001)
#define IOMUX_PINCM59_PF_TIMG8_CCP0                   ((uint32_t)0X00000004)
#define IOMUX_PINCM59_PF_TIMA_FAULT0                  ((uint32_t)0X00000005)
#define IOMUX_PINCM59_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000006)

/* IOMUX_PINCM60[PF] Bits */
#define IOMUX_PINCM60_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM60_PF_GPIOA_DIO27                  ((uint32_t)0X00000001)
#define IOMUX_PINCM60_PF_TIMG8_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM60_PF_TIMA_FAULT2                  ((uint32_t)0X00000005)
#define IOMUX_PINCM60_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM60_PF_LFSS_RTC_OUT                 ((uint32_t)0X00000007)


#if   defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050))
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

/*@}*/ /* end of group MSPM0L111X_PeripheralDecl */

/*@}*/ /* end of group MSPM0L111X_Definitions */

#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_m0p_mspm0l111x__include */

